wiki/2016-08-24-正则匹配可以又快又简单 .html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>正则匹配可以又快又简单</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">正则匹配可以又快又简单</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#reprint"><div class="category">reprint</div></a> </div>
<div class="char-counter">2016-08-24</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org93f6406">介绍：</a></li>
<li><a href="#orgc199bc9">正则表达式</a></li>
<li><a href="#orgb036ff4">有限状态机</a></li>
<li><a href="#org4d78ec3">将正则表达式转换为 NFA</a></li>
<li><a href="#org13a0e02">正则搜索算法</a></li>
<li><a href="#org8219b66">真实世界的正则实现</a></li>
<li><a href="#org8e367de">原文</a></li>
</ul>
</div>
</nav>
<p>
本文是翻译 Russ Cox 三篇关于正则表达式的文章中的第一篇 Regular Expression Matching Can Be Simple And Fast
 <a href="http://www.shahuwang.com/2014/07/01/%E6%AD%A3%E5%88%99%E5%8C%B9%E9%85%8D%E5%8F%AF%E4%BB%A5%E5%8F%88%E5%BF%AB%E5%8F%88%E7%AE%80%E5%8D%95%E4%B8%80.html">http://www.shahuwang.com/2014/07/01/正则匹配可以又快又简单一.html</a>
</p>

<div id="outline-container-org93f6406" class="outline-2">
<h2 id="org93f6406">介绍：</h2>
<div class="outline-text-2" id="text-org93f6406">
<p>
下图展示了两种正则表达式匹配效率的对比。其中一个广泛运用于很多语言的解析器，包括
Perl(图左）。另一个则仅用于少数几个地方，特别是 awk 和 grep 的实现上（图右）。这
两种方法在性能上有着非常大的差异：
</p>


<p>
              用正则a?nan匹配an耗时
</p>

<p>
这个正则里，用上标表示重复次数，如 a?3a3 表示正则 a?a?a?aaa . 上面这两幅图，对比
了两种方法实现的正则引擎，在用a?nan 匹配字符串an时所需要的时间。
</p>

<p>
值得注意的是，Perl 匹配 a29 的时候，需要耗时超过60秒。而另一种方法（标注为
Thompson NFA 的原因后面会解释），只需要 20 微秒，这不是打错字了，Perl 正则匹配的
那个图的时间刻度是秒，而 Thompson NFA 的那个图，时间刻度是微妙。Thompson NFA 方
法在匹配 a29 的时候比 Perl 快一百万倍。按照两幅图的函数曲线推算，Thompson NFA 方
法实现的正则引擎在匹配 a100 的时候，只需要不到 200 微妙，而 Perl 的那个实现，需
要超过 1015 年。（ Perl 只是大量使用此种算法的程序中比较显著的一个，左上图也可以
描绘 Python,PHP,Ruby 以及其他很多的语言在正则匹配上的性能。文章后面还会有一个更
详细的图表，展示其他实现的数据。） 这个图表展示的情况非常难以置信，也许你用过
Perl，它的正则也似乎从没有那么慢过。实际上，大部分时候，Perl 里的正则匹配的速度
是足够快的。不过，正如左上图所显示的，我们是可以写一种 “失控正则（pathological）”
令 Perl 匹配非常非常慢。相反，在 Thompson NFA 的实现里，是不会出现失控正则的。对
比看这两个图的时候，提示你一个问题：“为什么 Perl 不使用 Thompson NFA呢?” 实际上
是可以的，也是应该的，下面的文章将会介绍如何实现。 长期以来，正则表达式都是计算
机科学中，用来说明好的理论形成好的程序的著名例子之一，以前理论工作者仅仅是实现一
个简单的计算模型，但是 Ken Thompson 通过给 CTSS （ Cray Time Sharing System）的
QED 编辑器实现，把正则表达式介绍给了程序员们。Dennis Ritchie 仿效 Thompson ，也
在其给 GE-TSS 写的 QED 里实现了正则引擎。后续 Thompson 和 Ritchie 还将创造 Unix，
并把正则表达式也带入到了 Unix 里。上世纪 70 年代后期，正则表达式已经是 Unix 世界
里的关键特征了，如 ed, sed, grep, egrep, awk 和 lex 这些工具都使用了正则表达式。
</p>

<p>
如今，正则表达式也是一个用来说明忽略好的理论导致不好的程序的著名例子。当今的很多
流行工具里实现的正则表达式，比 30 多年前的 Unix 工具都要慢。
</p>

<p>
本文回顾了一些好的理论：正则表达式，有限状态机，以及由 Ken Thompson 在上世纪 60
年代中期发明的正则表达式搜索算法。同时，还将这些理论予以实践，描述了 Thompson 的
算法的简单实现。这份少于 400 行 C 语言代码的实现，就是上面那个和 Perl 对比的那个。
它胜过了 Perl， Python， PCRE 等这些跟复杂的实现。本文归纳并总结了如何将一个理论
转换为实践。
</p>
</div>
</div>


<div id="outline-container-orgc199bc9" class="outline-2">
<h2 id="orgc199bc9">正则表达式</h2>
<div class="outline-text-2" id="text-orgc199bc9">
<p>
正则表达式是指用来描述一组字符串的记号。当在这组字符串中有一个特定的字符串可以被
一个正则表达式描述，那么我们就说这个正则表达式匹配这个字符串。 最简单的正则表达
式是一个单一的常值字符（literal character)。除了特殊的元字符 *+?()|, 字符都是匹
配其自身（译注：这篇文章实现的正则表达式是最简单基本的那种，只有这几个元字符）。
要匹配元字符，用一个反斜杠放在他们前面，如 \+ 匹配 + 号。 两个正则表达式可以进行
并联或者串联形成一个新的正则表达式：如果 e1 匹配 s, 而 e2 匹配 t, 则 e1|e2 匹配
s 或者 t, e1e2 则匹配 st。 元字符 *, <del>, 和 ? 是重复操作符： e1∗ 匹配零个或者多个
能被 e1 匹配的字符串。e1</del> 匹配一个或者多个；e1? 匹配零个或者一个。 这些操作符，从
弱到强的结合，分别是并联，串联和重复操作符。括号则可以用来改变结合顺序，就如数学
运算中的一样。 当前描述的正则语法，是传统的 Unix 工具 egrep 正则语法的一个子集。
这个子集已经足够用来描述所有的正则语言了：宽泛一点来说，正则语言是指能够在一定的
内存占用下，通过单趟扫描文本，可以进行匹配的 一组字符串。最新的正则表达式用法
（主要是 Perl 和那些抄袭它的）增加了许多操作符和转义符号。这些增加的功能令正则表
达式更加简明，不过有时也变得更加隐晦了，但通常没有更加强大：那些新的神奇的正则
表达式，通常有一个更长的传统正则表达式与之等价。 一个常见的正则扩展是反向引用。
一个反向引用，如\1 或者 \2 表示的是匹配其前面用括号括起来的子正则表达式捕获的第
一组或者第二组内容。如 (cat|dog)\1 匹配的是字符串 catcat 或者 dogdog， 而不是
catdog或dogcat，因为\1表示匹配其前面第一组子表达式（用括号括起来的）匹配到的内容，
前面匹配到cat，这里也必须是cat。 不过从理论上说，反向引用并不属于正则表达式。反
向引用的强大是以巨大的消耗为代价的：在最坏的情况下，即使是最好的实现，搜索算法的
时空 消耗都是指数级的，就像 Perl 那样。Perl 以及其他语言现在当然不可能移除反向引
用，不过他们可以给没有反向引用的正则表达式一个更高效的算法实现，就像上面说的那个。
本文就是关于那些高效的正则引擎实现算法的。
</p>
</div>
</div>


<div id="outline-container-orgb036ff4" class="outline-2">
<h2 id="orgb036ff4">有限状态机</h2>
<div class="outline-text-2" id="text-orgb036ff4">
<p>
另一种可以用来描述一组字符的方式是有限自动机。有限自动机也叫状态机，下文将会交互
使用自动机和状态机。 一个简单的例子，下图的这个状态机描述了一组可以被正则表达式
a(bb)+a 匹配的字符串：
</p>


<p>
一个有限自动机总是处于其某一个状态之中，在图中以圆圈表示这些状态。当状态机读取了
一个字符，它就从一个状态转移到另一个状态去了。上图这个自动机有两个特殊的状态，开
始状态 S0 和匹配状态 S4 ，开始状态用一个长箭头指向它（箭头尾部不接另一个状态），
匹配状态则是用双圆圈描绘。 状态机一次读取一个字符，对应的箭头就将状态机从一个状
态移动到另一个状态。举例来说，如果输入字符串是 abbbba，当状态机读取到第一个字符
a 的时候，它此时处于开始状态 S0 , 然后它跟随箭头进入到状态 S1 , 当状态机读取剩下
的字符串的时候，这个过程就这样重复下去，读取 b 到 S2 ,读取 b 到 S3, 读取 b 到
S2, 读取 b 到 S3 ,最后读取 a 到 S4。
</p>



<p>
状态机停在 S4, 一个匹配状态，所以这个正则匹配了这个字符串。如果一个状态机停留在
非匹配状态，那么它就不匹配这个字符串。在状态机运行的过程中，如果发现没有一个箭头
对应输入的字符，那么状态机就马上停止。 刚才我们所说的状态机称作确定有限状态机
（DFA），因为在任意一个状态，每个可能的输入都只对应着最多一个状态。我们也可以创
建一个状态机，其需要在多个状态里选择一个作为下一个状态，如下图，这个状态机和上面
的那个是对等的，但是它是非确定性的：
</p>


<p>
这个状态机是非确定的，是因为当它处于 S2 的时候，如果其读入一个 b，它有多个下一个
状态可选： 它可以回到 S1 去，以其后面出现多一个 bb 字符串。也可以走到 S3 去，以
其后面出现一个a。由于状态机不能预看剩下的字符，它无从知道哪一个是正确的。在这种
情况下，如何让状态机总是猜对就变得很有趣了。这样的状态机称作非确定性有限状态机
（NFA）。 有时候，让 NFA 有一些没有字符对应的空箭头令处理起来非常方便。一个 NFA
可以在任何时候，在没有任何输入的情况下，跟随空箭头到下一个状态。 下图这个状态机
和之前的那两个是对等的，但是空箭头令这个状态机对应 a(bb)+a 看起来更加清晰：
</p>
</div>
</div>



<div id="outline-container-org4d78ec3" class="outline-2">
<h2 id="org4d78ec3">将正则表达式转换为 NFA</h2>
<div class="outline-text-2" id="text-org4d78ec3">
<p>
正则表达式和 NFA 在能力上是等价的： 每一个正则表达式都有一个等价的 NFA （它们匹
配同意的字符串），反之亦然。另外，DFA 在能力上也是和 NFA 以及正则表达式是等价的，
后面我们将会说到这个。有很多种方法可以把正则表达式转换为 NFA，本文描述的方法最早
是由 Thompson 发表在他 1968 年 CACM 的论文上的。 对应一个正则表达式的 NFA 是由多
个对应子正则表达式的部分 NFA 组成的，每一个操作符都有不同的构造。 部分 NFA 是没
有匹配状态的，相反，他们有一个或者多个引出的不指向任何状态的箭头，最终构造程序会
将这些箭头连接起来指向一个匹配状态。 匹配一个单一字符的 NFA 如下图：
</p>

<p>
e1e2 两个正则的串联的 NFA，如下图，状态机 e1 的末尾箭头指向状态机 e2 的开始状态。
</p>

<p>
e1|e2 两个正则的并联，如下图，增加一个新的开始状态，可以选择去 e1 或者 e2 。
</p>

<p>
正则 e? 则如下图这个 NFA，与一个空路径并联：
</p>

<p>
正则 e∗ 与上面差不多，不过增加了一个接受 e 之后返回到开始的循环：
</p>

<p>
正则 e+ 的 NFA 如下图，有一个循环，至少需要通过 e一次：
</p>

<p>
通过上面这些图，我们可以知道，除了括号之外，自动机技术为正则表达式里的每一个字符
或者元字符创建一个状态。因此，最终的 NFA，最多只有与原正则表达式字符长度一样多的
状态。
</p>

<p>
正如之前对 NFA 的讨论，我们是可以把 NFA 的空箭头移除的，也可以优先生成一些没有空
箭头的 NFA。 但是有空箭头的 NFA 令我们读起来和理解起来更容易， 而且也令 C 语言的
实现上更加简单，所以我们会保留着他们。
</p>
</div>
</div>



<div id="outline-container-org13a0e02" class="outline-2">
<h2 id="org13a0e02">正则搜索算法</h2>
<div class="outline-text-2" id="text-org13a0e02">
<p>
现在我们已经知道一个方法来测试一个正则表达式是否匹配一个字符串了：把这个正则表达
式转换为 NFA，然后用这个字符串做输入，看看 NFA 运行到哪里去。记住需要赋予 NFA 在
面临多个状态选择的时候，做出正确猜测的能力：让普通电脑上运行一个 NFA，我们需要找
到一个模拟这种猜测的方法。 一个可行的方法是先选其中一个可选项，如果它不行，就尝
试另一个。比如，看看如下这个对应正则 abab|abbb 的 NFA 在遇到 abbb 时的运行情况：
</p>



<p>
在 step 0 的时候，这个 NFA 要做一个选择：到底是去匹配 abab 呢还是去匹配 abbb ?
在上图中，它去尝试 NFA , 但是在 step 3 的时候失败了。然后它尝试另一个选择，在
step 4 的时候匹配成功了。这种回溯的方法可以用递归简单实现，但是它需要多次扫描字
符串，而且可能会尝试完所有的路径。 上面这个例子只是有两个不同的路径，但是在最坏
的情况下，可能会有指数级的可选路径，这样就会非常慢了。 另一种更高效的方法是同时
选择所有可选路径进行模拟，这个模拟需要状态机可以同时处于多个状态。
</p>

<p>
在 step 1 和 step 2， 这个 NFA 同时处于两个状态，到了 step 3 的时候，此时只处于
一个状态了。这种多状态方法同时尝试所有的路径，只需要扫描一次的字符串。最坏的情况
是在任何一个步骤下，这个状态机处于所有可选状态 之中，不过即使如此，也只是需要一
个常量时间，时间的长短只取决于字符串的长度。所以任意大的输入都只需要线性时间来处
理而已。这对于需要回溯方法的指数 时间，简直是巨大的提升。之所以效率提升这么大，
是因为我们追踪哪些状态可以到达，而不是哪些路径可以到达。一个有 n 个节点的 NFA，
每一个步骤都最多有 n 个状态可达，但是却有2n 条路径。
</p>
</div>
</div>
