wiki/2016-08-24-正则匹配可以又快又简单 .html


<div id="outline-container-org8219b66" class="outline-2">
<h2 id="org8219b66">真实世界的正则实现</h2>
<div class="outline-text-2" id="text-org8219b66">
<p>
在生产环境中使用的正则表达式远比上面实现的那个正则引擎能处理的情况复杂得多。本节
主要简单描述一下一些共通的复杂度，完整的介绍已经超过了一篇介绍性文章的范围。字符
集合：一个字符集，无论是[0-9] 还是 \w 或者 . (点号), 都仅仅是一个替代的简明表示。
这些字符集可以在编译过程中展开为其替代的内容，不过添加一个它们完整明确表示新的
NFA 节点会更加有效。POSIX 定义了一些特殊的字符集，如 \[\[:upper:\]\] ，会根据当前的区域
改变其意义，达到这个目标最难的不是把它们的意义编码为 NFA，而是确定他们的意义。转
义序列 真正的转义序列需要处理转义序列，比如要匹配一些元字符如\( , \) ，\\ 等。另
外还有能匹配一些打不出来的字符，如换行符\n重复计数 很多正则引擎都提供了重复计数
操作符，如{n} 表示匹配 n 次，{n,m} 匹配最少 n 次，且不超过 m 次。而{n,} 则表示匹
配 n 次或者更多。递归的回溯正则实现可以用一个循环实现重复计数。而基于 NFA 或者
DFA 的实现则必须将重复计数展开，如 e{3} 展开为 eee, e{3,5} 展开为 eeee?e?, e{3,}
则展开为 eee+. 子匹配提取 当正则用来进行字符串财富或者解析的时候，能找出输入字符
串的哪一部分被哪个子正则匹配了，还是很有用的。很多正则引擎可以提取出括号括起来的
子正则匹配的字符串，如在 Perl 里，使用如下正则，可以分部分提取出输入字符串（日期
和时间字符串）中各个部分的内容：if(<i>([0-9]+-[0-9]+-[0-9]+) ([0-9]+:[0-9]+)</i>){
print "date: $1, time: \(2\n"; }子匹配边界的提取一直是被计算机科学理论所忽视的，
而它也是很多正则引擎使用递归回溯最主要的原因。不过，Thompson 这类型的算法是可以
在不影响性能的情况下，调整为可追踪子匹配边界的算法。在早至 1985 年的时候，第八版
的 regexp(3) 已经实现了一个这样的算法，不过并没有广泛使用，甚至很少被提起过，下
文将会对它进行说明。不固定匹配（unanchored match) 本文都假设正则是和整个的输入字
符串对应匹配的，但现实中，我们更需要的是找出输入字符串中被正则匹配的部分。Unix
的工具一般都返回的是从最左起的最长匹配。对 e 的不固定搜索，其实是特殊的子匹配提
取，它其实和 .*(e).* （.*限制为只匹配最短）这个正则是一样的。非贪心操作符 在传统
的 Unix 正则里，重复操作符 ?, * 和 + 都是最大最多匹配的，比如用(.+)(.+) 去匹配
abcd 的时候，第一个 (.+) 会匹配完 abc，然后第二个会匹配 d。这些操作符称之为贪心
操作符。Perl 引进了 ??, *? 和 +? 作为非贪心操作符，它们会尽可能少匹配，如
(.+?)(.+?) 去匹配 abcd 的时候，第一个 (.+?) 会匹配一个 a，第二个则会匹配bcd。根据
定义，贪心非贪心，都不用影响一个正则是否匹配一个字符串，只会影响括号括起来的子正
则匹配的情况。在回溯算法里使用过一些建的的非贪心操作符实现，先尝试去匹配短的，然
后再去匹配长的。断言 传统的正则元字符 ^ 和 \) 可以看做其周围字符串的断言：^ 断言
在其之前是一新行（或者一个字符串的开头），$ 则断言下一个字符串是新行（或者一个字
符串的结尾) 。Perl 使用了更多的断言，如 \b 断言其前一个字符是文字和数字，而其下
一个则不是。Perl 还提供了前瞻断言，(?=re) 就断言当前位置之后的字符串可被正则 re
匹配，而且并不改变当前指向的字符串位置。(?&lt;=re)则提供了逆序环视，与前瞻断言功能
相反，是回看断言。反向引用 就像之前提到的，没有人知道怎么能够高效实现反向引用，
而没有人能够证明这是不可能的。实际上，这个问题是 NP-complete, 如果有人可以高效实
现，那么这将成为计算机界轰动的大事，也将获得一百万美元大奖。 关于反向引用简单高
效的实现，那就是不去实现它。但现在这个策略已经行不通了，很多用户越来越依赖反向引
用，而且反向引用已经成了 POSIX 正则标准里的一部分了。尽管如此，还是需要在大部分
情况下使用 Thompson 的 NFA 模拟算法，只有在出现反向引用的时候才选择其他实现。一
个特别聪明的实现，是把这两者结合起来，反向引用的归反向引用。反向引用与
memoization Perl 使用 memoization 来尽可能防止在出现反向引用的时候引起指数爆炸，
在理论上，其应该是可以达到和 NFA 方法相同的效果。但是 memoization 并没有完全解决
这个问题，这需要的内存大概是文本长度和正则长度相乘之积。 memoization 同样没有解
决反向引用栈空间的使用问题，它和文本长度线性相关，对于长文本，直接会耗尽栈空间。
如下这个正则就运行不了：$ perl -e '("a" x 100000) =~ <i>^(ab?)*$</i>;'
</p>
</div>
</div>
